In [1]:
import numpy as np
import pandas as pd

***easy way of data frame***

In [2]:
dict = {
    "name": ['ali', 'ayesha', 'amna'],
    "marks" : [23, 45, 67],
    "city" : ['lahore', 'karachi', 'quetta']
}

In [3]:
d1 = pd.DataFrame(dict)

In [4]:
d1

     name  marks     city
0     ali     23   lahore
1  ayesha     45  karachi
2    amna     67   quetta

***accessing series/columns/keys***

In [5]:
d1["name"]

0       ali
1    ayesha
2      amna
Name: name, dtype: object

***d1[0] will give erroe***

***accessing and editing specific values in dataframe***

In [6]:
d1["marks"][1] = 50

C:\Users\mahee\AppData\Local\Temp\ipykernel_13824\3996052399.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  d1["marks"][1] = 50

In [7]:
d1

     name  marks     city
0     ali     23   lahore
1  ayesha     50  karachi
2    amna     67   quetta

In [8]:
d1.loc[ 2 , "city"] = "lah"

In [9]:
d1

     name  marks     city
0     ali     23   lahore
1  ayesha     50  karachi
2    amna     67      lah

***printing and editing indexes and columns***

In [10]:
d1.index

RangeIndex(start=0, stop=3, step=1)

In [11]:
d1.index = ["first", "second", "third"]

In [12]:
d1

          name  marks     city
first      ali     23   lahore
second  ayesha     50  karachi
third     amna     67      lah

In [13]:
d1.columns

Index(['name', 'marks', 'city'], dtype='object')

In [14]:
d1.columns = list("ABC")

In [15]:
d1

             A   B        C
first      ali  23   lahore
second  ayesha  50  karachi
third     amna  67      lah

***dealing with head and tals of dataframe***

In [16]:
d1.head(2)

             A   B        C
first      ali  23   lahore
second  ayesha  50  karachi

In [17]:
d1.tail(2)

             A   B        C
second  ayesha  50  karachi
third     amna  67      lah

***for stats***

In [18]:
d1.describe()

               B
count   3.000000
mean   46.666667
std    22.188586
min    23.000000
25%    36.500000
50%    50.000000
75%    58.500000
max    67.000000

***advanced way of initializing dataframe***

In [19]:
d2 = pd.DataFrame( np.random.rand(10,5), index = np.arange(10) )

In [20]:
d2

          0         1         2         3         4
0  0.980676  0.932129  0.084025  0.369050  0.919292
1  0.147810  0.750657  0.062138  0.950975  0.546676
2  0.923535  0.406245  0.307917  0.042456  0.212776
3  0.232023  0.429345  0.058066  0.631897  0.470309
4  0.201096  0.649784  0.917233  0.147132  0.785791
5  0.069428  0.868917  0.822174  0.260637  0.775472
6  0.236384  0.558645  0.418246  0.115386  0.517622
7  0.314233  0.960805  0.352328  0.831473  0.162486
8  0.001884  0.389433  0.158457  0.200303  0.818983
9  0.207177  0.676745  0.715829  0.027915  0.490811

In [21]:
d2[0][0] = "Hi"

C:\Users\mahee\AppData\Local\Temp\ipykernel_13824\900172558.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'Hi' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  d2[0][0] = "Hi"

In [22]:
d2

          0         1         2         3         4
0        Hi  0.932129  0.084025  0.369050  0.919292
1   0.14781  0.750657  0.062138  0.950975  0.546676
2  0.923535  0.406245  0.307917  0.042456  0.212776
3  0.232023  0.429345  0.058066  0.631897  0.470309
4  0.201096  0.649784  0.917233  0.147132  0.785791
5  0.069428  0.868917  0.822174  0.260637  0.775472
6  0.236384  0.558645  0.418246  0.115386  0.517622
7  0.314233  0.960805  0.352328  0.831473  0.162486
8  0.001884  0.389433  0.158457  0.200303  0.818983
9  0.207177  0.676745  0.715829  0.027915  0.490811

***converting into excel***

In [23]:
d1.to_csv("first_excel.csv", index = False)

In [24]:
d1

             A   B        C
first      ali  23   lahore
second  ayesha  50  karachi
third     amna  67      lah

***converting into numpy array (2d)***

In [25]:
d1.to_numpy()

array([['ali', 23, 'lahore'],
       ['ayesha', 50, 'karachi'],
       ['amna', 67, 'lah']], dtype=object)

***sorting rows and columns in descending order***

In [26]:
d1.sort_index( axis = 0, ascending = False)

             A   B        C
third     amna  67      lah
second  ayesha  50  karachi
first      ali  23   lahore

***copying the dataframe into another***

In [27]:
newdict = d1.copy()

In [28]:
newdict

             A   B        C
first      ali  23   lahore
second  ayesha  50  karachi
third     amna  67      lah

***to delete a column or row***

In [29]:
d1.drop( "C" , axis = 1 )

             A   B
first      ali  23
second  ayesha  50
third     amna  67

In [30]:
d1.drop( "third", axis = 0)

             A   B        C
first      ali  23   lahore
second  ayesha  50  karachi